{
    "copyright": "&copy; 2025 Giuseppe Rocco. All rights reserved.",
    "important": "IMPORTANT",
    "warning": "WARNING",
    "tip": "TIP",

    "index": {
        "button-privacy": "LICENSE",
        "button-download": "DOWNLOAD",
        "slogan-line1": "Streamlined Virtualization",
        "slogan-line2": "tailored for macOS."
    },

    "license": {
        "title": "License Agreement",

        "section1": {
            "title": "LAST UPDATED: February 2025",
            "content": "This License Agreement (\"License\") is a legal agreement between you (either an individual or a legal entity) and Giuseppe Rocco (\"Licensor\") for the use of the binary .xcframework known as VirtualizationKit or VZKit (the \"Software\"). By using, embedding, or otherwise utilizing the Software, you agree to be bound by the terms of this License."
        },

        "section2": {
            "title": "1. GRANT OF LICENSE",
            "content": "1.1 License Grant<br>Licensor hereby grants you a non-exclusive, non-transferable, revocable license to embed and use the Software in your own software projects, whether for personal or commercial use, provided you comply with all the terms and conditions of this License.<br><br>1.2 Attribution Requirement<br>You must provide clear attribution to the Software and to the Licensor (for example, in an \"About\" or \"Credits\" section) in any product or project that uses or includes the Software. All uses—whether private, public, free, or commercial—must properly credit the Licensor."
        },

        "section3": {
            "title": "2. RESTRICTIONS",
            "content": "2.1 No Tampering<br>You shall not modify, alter, disassemble, decompile, decrypt, or otherwise attempt to derive the source code of the Software. Any attempt to circumvent or interfere with any security measures or technical protections implemented by the Licensor within the .xcframework is strictly prohibited.<br><br>2.2 No Reverse Engineering<br>You shall not reverse engineer, decompile, or disassemble the Software or attempt to discover or use any underlying algorithms, methods, or techniques except as expressly allowed by applicable law (and only to the extent such law cannot be contractually waived).<br><br>2.3 No Redistribution or Re-marketing<br>You shall not redistribute, resell, sublicense, rent, lease, or re-market the Software, in whole or in part, as a standalone product or as part of any other framework, library, or offering that is designed to compete with or replace the Software. The Software is licensed for integration into your own software projects but not for independent redistribution.<br><br>2.4 Attribution Is Mandatory<br>Under no circumstances may you embed or use the Software in a project or product without providing attribution as specified in Section 1.2. Failure to properly credit the Licensor and Software is a direct violation of this License."
        },

        "section4": {
            "title": "3. PROPRIETARY RIGHTS AND CONFIDENTIALITY",
            "content": "3.1 Proprietary Rights<br>The Software, including all associated intellectual property rights, is owned and will remain the exclusive property of the Licensor. This License does not constitute a sale of the Software or any copy thereof.<br><br>3.2 Confidentiality<br>The Software is proprietary and confidential. You may not disclose any proprietary or confidential information in the Software to any third party, except as necessary to exercise your rights under this License.<br><br>3.3 Source Code<br>The source code of the Software is proprietary and is not provided under this License. Unauthorized copying, modification, or distribution of the Software’s source code, via any medium, is strictly prohibited and may be subject to legal action."
        },

        "section5": {
            "title": "4. TERMINATION",
            "content": "4.1 Termination by Licensor<br>Licensor may terminate this License immediately if you fail to comply with any term or condition herein. Upon termination, you must cease all use and destroy all copies of the Software in your possession or control.<br><br>4.2 Survival<br>Sections pertaining to confidentiality, restrictions on use, liability limitations, and disclaimers of warranty shall survive any termination of this License."
        },

        "section6": {
            "title": "5. DISCLAIMER OF WARRANTY",
            "content": "THE SOFTWARE IS PROVIDED ON AN \"AS IS\" AND \"AS AVAILABLE\" BASIS, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE, AND NON-INFRINGEMENT. LICENSOR DOES NOT WARRANT THAT THE SOFTWARE WILL MEET YOUR REQUIREMENTS OR THAT ITS OPERATION WILL BE UNINTERRUPTED OR ERROR-FREE."
        },

        "section7": {
            "title": "6. LIMITATION OF LIABILITY",
            "content": "IN NO EVENT SHALL LICENSOR BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO LOSS OF PROFITS, LOSS OF DATA, OR LOSS OF BUSINESS) ARISING OUT OF THE USE OR INABILITY TO USE THE SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. LICENSOR’S ENTIRE LIABILITY UNDER THIS LICENSE SHALL NOT EXCEED THE TOTAL AMOUNT YOU PAID (IF ANY) FOR THE SOFTWARE."
        },

        "section8": {
            "title": "7. GENERAL",
            "content": "7.1 Governing Law<br>This License shall be governed by and construed in accordance with the laws of the jurisdiction in which the Licensor resides, without regard to its conflict of laws provisions.<br><br>7.2 Severability<br>If any provision of this License is held to be invalid or unenforceable, the remaining provisions will remain in full force and effect.<br><br>7.3 No Waiver<br>No waiver by Licensor of any breach of this License shall be construed as a waiver of any other or subsequent breach.<br><br>7.4 Entire Agreement<br>This License constitutes the entire agreement between you and the Licensor concerning the Software and supersedes all prior or contemporaneous communications and proposals (whether oral, written, or electronic) between the parties."
        },

        "section9": {
            "title": "AGREEMENT",
            "content": "BY USING OR EMBEDDING THE SOFTWARE, YOU ACKNOWLEDGE THAT YOU HAVE READ AND UNDERSTOOD THIS LICENSE AND AGREE TO BE BOUND BY ITS TERMS AND CONDITIONS."
        }
    }
}